Repository: muscla87/wordle-telegram-bot
Catalog: Wordle.Bot.Functions/Resources/Resources.Messages.*.resx
Languages: it

# Welcome
source: ✨Welcome✨ *{0}*\! I am happy you came here to play ❤️ Send /newgame command to start playing\!
it: ✨Ciao✨ *{0}*\! Sono felice di averti qui a giocare ❤️ Invia il comando /newgame per iniziare a giocare\!

# DictionaryUpdateConfirmation
source: 👍 I'll pick a word from the selected dictionary for the next game\!
it: 👍 Nella prossima partita sceglierò una parola dal dizionario che hai selezionato\!

# DictionaryUpdatePrompt
source: Please select the dictionary you want to use.
it: Seleziona il dizionario con cui vuoi giocare.

# GameInProgressError
source: 🎮 Please complete the game in progress before starting a new one 🕹
it: 🎮 Non posso avviare una nuova partita se non concludi quella in corso 🕹

# InstructionsCaption
source: Guess the WORD in six tries\. *Start typing your guess and send it to me\!*
it: Indovina la PAROLA di 5 lettere in almeno sei tentativi\. * Inizia a scrivere una parola in chat ed inviala\!*

# WordTooLongError
source: 🙇 Sorry, I can't accept this word because is *too long*
it: 🙇 Mi dispiace, la parola inserita è *troppo lunga*

# WordTooShortError
source: 🙇 Sorry, I can't accept this word because is *too short*
it: 🙇 Mi dispiace, la parola inserita è *troppo corta*

# WordNotInDictionaryError
source: 🙇 Sorry, this word is *not in the game dictionary*: {0} 📚 🤔
it: 🙇 Mi dispiace, la parola inserita *non è presente nel dizionario {0}* 📚 🤔

# EndOfGameGuessed
source: 🎉 Congratulations, you guessed the word {0} in {1} guesses\! 🎉
it: 🎉 Ben fatto, hai indovinato {0} in {1} tenativi\! 🎉

# EndOfGameNotGuessed
source: 🙇 Sorry, you didn't guess the word {0} 🙇
it: 🙇 Mi dispiace, non sei riuscito ad indovinare la parola {0} 🙇

# SendNewGameToPlayAgain
source: Send /newgame command to play again
it: Invia il comando /newgame per giocare di nuovo

# UnexpectedError
source: Sorry, something went wrong processing your message. 😥 Please try again later.
it: Mi dispiace, qualcosa è andato storto durante l'elaborazione del messaggio. 😥 Riprova più tardi.

# changedictionaryCommandDescription
source: Change the dictionary language (i.e. English, Italian, etc..)
it: Scegli da quale dizionario saranno selezionate le parole da indovinare (Italiano, Inglese)

# howtoplayCommandDescription
source: Shows game rules and how to play information
it: Visualizza le regole di goico e le istruzioni per giocare

# newgameCommandDescription
source: Starts a new game if the current one is over
it: Avvia una nuova partita se quella corrente è terminata

# showboardCommandDescription
source: Shows the current game board
it: Visualizza il tabellone di gioco

# ItalianDictionaryName
source: Italian
it: Italiano

# EnglishWordleOriginalDictionaryName
source: English
it: Inglese

# helpCommandDescription
source: Shows the command list
it: Visualizza la lista dei comandi

# StatisticsWinRateLine
source: \#{WinRatePosition}🏅 *Games* {GamesPlayedCount} 🏆 {WinRate}%
it: \#{WinRatePosition}🏅 *Partite* {GamesPlayedCount} 🏆 {WinRate}%

# StatisticsStreakLine
source: \#{BestStreakPosition}🏅 *Streak* {CurrentStreak} \(best {BestStreak}\)
it: \#{BestStreakPosition}🏅 *Striscia vittorie* {CurrentStreak} \(migliore {BestStreak}\)

# StatisticsPointsLine
source: \#{PointsPosition}🏅 *Points* {TotalPoints} \({AveragePoints} per game\)
it: \#{PointsPosition}🏅 *Punti* {TotalPoints} \({AveragePoints} per partita\)

# StatisticsEndingLine
source: Share this message to brag with your friends ✨ Play wordle on t\.me/WordleChatBot
it: Condividi questo messaggio per vantarti e sfidare i tuoi amici ✨ Gioca a wordle su t\.me/WordleChatBot

# StatisticsNoDataAvailable
source: There aren't enough games played to show statistics
it: Non hai giocato abbastanza partite per visualizzare le statistiche

# statsCommandDescription
source: Show played games statistics and your ranking
it: Visualizza statistiche e posizione in classifica
